"""
Задача №1.

Програма отримує на вхід послідовність цілих невід’ємних чисел,
кожне число вводиться в окремому рядку. Послідовність завершується
числом 0, при зчитуванні якого програма повинна закінчити свою
роботу і вивести кількість членів послідовності (не рахуючи
завершального числа 0).

Автор: Костючик Валерія Дмитрівна
"""


count = 0

while True:
    num = int(input("Введіть число: "))

    if num == 0:
        break
    else:
        count += 1

print("Кількість членів послідовності: ", count)



